OpenFOAM-6-cantera-openmpi/tutorials/incompressible/pimpleFoam/laminar/planarContraction/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType laminar;

laminar
{
    laminarModel        Maxwell;

    MaxwellCoeffs
    {
        nuM             0.002;
        lambda          0.03;
    }

    printCoeffs         on;
}

// ************************************************************************* //
